package day09.com.ict.edu;

import java.util.Iterator;

public class Ex01_Array {
	public static void main(String[] args) {
		// 나 초반에 늦어서 다시 알아야함//배열
		// 배열 : 같은 자료형의 데이터들을 한곳에 모아둔 묶음.
		// 반드시 같은 자료형이어야한다. (단, 프로모션, 디모션 가능)
		// 생성할때 반드시 크기를 지정해야 된다.
		// 한번 지정된 크기는 변경되지 않는다.(배열 카피를 하면 크기를 변경 할 수 있다.)
		// 배열데이터를 추출할때는 일반적으로 for문을 사용한다. (전용 for 문도 있다!)
		// 배열의 종류 : 1차원 배열과 다차원 배열(배열 안에 배열이 존재)
		// 기본자료형(char etc..) 배열과 참조자료형 배열(객체배열-Class를 배열로 사용.String도.)

		// 배열 생성 순서 : 선언 => 생성 => 초기화(데이터저장)
		// 1. 선언 : 자료형[] 이름; 또는 자료형 이름[];
		int[] su;

		// 2. 생성 : 이름 = new 자료형[배열의 크기 = 방의 수 = length = 길이] ;
		// new 예약어 : 메모리에 데이터를 저장할 공간을 만들어라
		// => 인스턴스, 객체 생성
		su = new int[4];

		// 3. 데이터 저장 : 이름[index = 방번호 = 위치 = 0부터]
		// 같은 자료형이어야만 저장가능.(프로모션, 디모션 가능)
		su[0] = 100;
		su[1] = 'a'; // 프로모션
		su[2] = (int) 2.4; // 디모션 = 형변환 하면 가능
		su[3] = 124;
		// su[4] = 14; //실행오류 (배열크기보다 크면 실행오류)
		su[0] = 12; // 현재 데이타를 삭제하고 12가 저장된다.(변수와 같음)

		// 배열을 호출하면 주소(생성ID가 출력)
		System.err.println(su);
		System.err.println(su[0]);
		System.err.println(su[1]);
		System.err.println(su[2]);
		System.err.println(su[3]);

		// 배열의 출력은 일반적으로 for문 사용
		for (int i = 0; i < su.length; i++) {
			System.out.println(su[1]);
		}
		System.out.println("======================");

		// 개선된 for문 : 배열이나 컬렉션에 주로 사용
		// 배열 전체에 대해서 정보출력 및 가공가능
		// 그러나 특정 몇개나 특정 하나를 별도로 출력 하거나 가공할수없다.(단점)//범위 조건문은 가능(100인데 90이하라던가.). 인덱스값
        // 인덱스값을 이용할 수 없다. 
		
		// : => 오른쪽 배열 데이터를 하나씩 순서대로 왼쪽에 넘긴다.
		for (int k : su) {
			System.out.println(k);
		}
	}
}
